
use [قاعدة بيانات سجن الاخيره]

-- انشاء الجداول --- DDL -----


-- السجن
create table السجن
(
   رقم_السجن int,
   الاسم varchar(50),
   العنوان varchar(50),
   عدد_السجناء int,
    هوية_المدير int,
   primary key(رقم_السجن)
)


-- السجين

create table السجين
(

 الهوية int ,
 الاسم_الاول varchar(50),
 الاسم_الاخير varchar(50),
 تاريخ_الميلاد date,
 العنوان varchar(50),
 الجنس varchar(10),

 primary key(الهوية)
)


-- الموظف

create table الموظف
(
 الهوية int,
 الاسم varchar(50),
 الراتب int,
 العنوان varchar(50),
 الجنس varchar(10),
 primary key(الهوية)
)


--الظابط

create table الظابط
(
 الهوية int,
 الرتبة varchar(10),
 primary key(الهوية)
)

-- السجن-السجين

create table السجن_السجين
(
 هوية_السجين int,
 رقم_السجن int,
 primary key(هوية_السجين)
)

-- السجن_الموظف

create table السجن_الموظف
(
 هوية_الموظف int,
 رقم_السجن int,
 primary key(هوية_الموظف)
)

--الحالة الصحية

create table الحالة_الصحية
(
 رقم_الحالة int,
 هوية_السجين int,
 حالة_الان varchar(50),
 امراض_ادمان varchar(10),
 primary key(رقم_الحالة,هوية_السجين)
)



--الحالة الاجتماعيه

create table الحالة_الاجتماعية
(
 رقم_الحالة int,
 هوية_السجين int,
 الزواج varchar(10),
 يعول_ام_لا varchar(10),
 عدد_افراد_اسرته int,
 سمعتة varchar(10),
 primary key(رقم_الحالة,هوية_السجين)
)


--الحالة الجنائية 

create table الحالة_الجنائية 
(
 رقم_الحالة int,
 هوية_السجين int,
 القضية varchar(20),
 تاريخ_الحكم date ,
 مدتها int,
 primary key(رقم_الحالة,هوية_السجين)
)


--الحالة المادية  

create table الحالة_المادية  
(
 رقم_الحالة int,
 هوية_السجين int,
 الطبقة varchar(10),
 مصادر_الثروة varchar(10),
 primary key(رقم_الحالة,هوية_السجين)
)


--الحالة السياسية   

create table الحالة_السياسية   
(
 رقم_الحالة int,
 هوية_السجين int,
 حالته varchar(30),
 امن_دولة varchar(10),
 primary key(رقم_الحالة,هوية_السجين)
)



--الحالة العلمية    

create table الحالة_العلمية    
(
 رقم_الحالة int,
 هوية_السجين int,
 المؤهل varchar(30),
 ينوى_اكماله varchar(10),
 primary key(رقم_الحالة,هوية_السجين)
)



--الحالة المهنية     

create table الحالة_المهنية     
(
 رقم_الحالة int,
 هوية_السجين int,
 المهنة varchar(10),
 الوظيفة varchar(10),
 primary key(رقم_الحالة,هوية_السجين)
)




--الحالة داخل السجن      

create table الحالة_داخل_السجن    
(
 رقم_الحالة int,
 هوية_السجين int,
 اسم_المستلم varchar(20),
 نوع_الحبس varchar(10),
 نوع_العمل varchar(10),
 نوع_الجريمة varchar(20),
 تفاصيل_جريمته varchar(50),
 تايخ_خروجه_المفترض date,
 تايخ_خروجه_كونه_قدوة_حسنة date,
 primary key(رقم_الحالة,هوية_السجين)
)


--الزيارات       

create table الزيارات     
(
 هوية_الزائر int,
 هوية_السجين int,
 اسم_الزائر varchar(10),
 وقت_الزيارة int,
 primary key(هوية_الزائر,هوية_السجين)
)
