use [قاعدة بيانات سجن الاخيره]

--تقرير بعدد السجناء
select COUNT(p.الهوية) as عدد_السجناء
from السجين p 


-- تقرير بعدد السجناء على حسب نوع الحبس ونوع العمل الذى يقوم به السجين

select count(p.الهوية) as عدد_السجناء,fk_p.رقم_السجن,pt.نوع_الحبس,نوع_العمل
from السجين p join الحالة_داخل_السجن pt
on p.الهوية=pt.هوية_السجين
join السجن_السجين fk_p
on fk_p.هوية_السجين=p.الهوية
group by fk_p.رقم_السجن,نوع_الحبس, نوع_العمل

--تقرير تفصيلى لكل سجين بالحالة الصحية والاجتماعية والمادية والسياسية

select *
from السجين p join الحالة_الاجتماعية pt
on p.الهوية=pt.هوية_السجين
join الحالة_الصحية ph
on p.الهوية=ph.هوية_السجين
join الحالة_المادية pm
on p.الهوية=pm.هوية_السجين
join الحالة_السياسية pp
on p.الهوية=pp.هوية_السجين


--تقرير بالسجناء الذين خرجوا كقدوه حسنه خلال مده معينه
select *
from السجين p join الحالة_داخل_السجن pp
on p.الهوية=pp.هوية_السجين
where GETDATE()>pp.تايخ_خروجه_كونه_قدوة_حسنة

-- مدير السجن ورتبتة

select e.*,o.الرتبة,p.الاسم as اسم_السجن
from الظابط o join الموظف e
on o.الهوية=e.الهوية
join السجن p
on o.الهوية=p.هوية_المدير